MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN64VFM5/mcu.h
#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register
#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TPL register.
//
//*****************************************************************************

#define TPL                           0x00007F80      // Transmit Packet Length Register
#define TPL                           0x00007F80      // Transmit Packet Length Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE register.
//
//*****************************************************************************

#define WBEIE                         0x00000040      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000020      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000010      // Packet Received Interrupt Enable
#define PTXIE                         0x00000008      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000004      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000002      // Preamble Start Interrupt Enable
#define TXFIE                         0x00000001      // Transmission Fail Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WB register.
//
//*****************************************************************************

#define WBASE                         0x00007F80      // CEA709.1-B WBASE register
#define WBASE                         0x00007F80      // CEA709.1-B WBASE register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S3 register.
//
//*****************************************************************************

#define PEF                           0x00000080      // Preamble Error Flag
#define WBEF                          0x00000040      // Wbase Expired Flag
#define ISD                           0x00000020      // Initial Sync Detect
#define PRXF                          0x00000010      // Packet Received Flag
#define PTXF                          0x00000008      // Packet Transmitted Flag
#define PCTEF                         0x00000004      // Packet Cycle Timer Expired Flag
#define PSF                           0x00000002      // Preamble Start Flag
#define TXFF                          0x00000001      // Transmission Fail Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S4 register.
//
//*****************************************************************************

#define INITF                         0x00000010      // Initial Synchronization Fail Flag
#define CDET                          0x00000018      // CDET
#define ILCV                          0x00000002      // Improper Line Code Violation
#define FE                            0x00000001      // Framing Error


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPL register.
//
//*****************************************************************************

#define RPL                           0x00007F80      // Received Packet Length
#define RPL                           0x00007F80      // Received Packet Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPREL register.
//
//*****************************************************************************

#define RPREL                         0x00007F80      // Received Preamble Length
#define RPREL                         0x00007F80      // Received Preamble Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_CPW register.
//
//*****************************************************************************

#define CPW                           0x00007F80      // CEA709.1-B CPW register
#define CPW                           0x00007F80      // CEA709.1-B CPW register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDT register.
//
//*****************************************************************************

#define RIDT                          0x00007F80      // CEA709.1-B Receive IDT register
#define RIDT                          0x00007F80      // CEA709.1-B Receive IDT register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDT register.
//
//*****************************************************************************

#define TIDT                          0x00007F80      // CEA709.1-B Transmit IDT Register ::
#define TIDT                          0x00007F80      // CEA709.1-B Transmit IDT Register


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCSR register.
//
//*****************************************************************************

#define Transmitter Enable            0x80000000      // Enables/disables the transmitter. When software clears this field, the transmitter remains enabled, and this bit remains set, until the end of the current frame.
#define Stop Enable                   0x40000000      // Configures transmitter operation in Stop mode. This field is ignored and the transmitter is disabled in all low-leakage stop modes.
#define Debug Enable                  0x20000000      // Enables/disables transmitter operation in Debug mode. The transmit bit clock is not affected by debug mode.
#define Bit Clock Enable              0x10000000      // Enables the transmit bit clock, separately from the TE. This field is automatically set whenever TE is set. When software clears this field, the transmit bit clock remains enabled, and this bit remains set, until the end of the current frame.
#define FIFO Reset                    0x02000000      // Resets the FIFO pointers. Reading this field will always return zero.
#define Software Reset                0x01000000      // When set, resets the internal transmitter logic including the FIFO pointers. Software-visible registers are not affected, except for the status registers.
#define Word Start Flag               0x00100000      // Indicates that the start of the configured word has been detected. Write a logic 1 to this field to clear this flag.
#define Sync Error Flag               0x00080000      // Indicates that an error in the externally-generated frame sync has been detected. Write a logic 1 to this field to clear this flag.
#define FIFO Error Flag               0x00040000      // Indicates that an enabled transmit FIFO has underrun. Write a logic 1 to this field to clear this flag.
#define FIFO Warning Flag             0x00020000      // Indicates that an enabled transmit FIFO is empty.
#define FIFO Request Flag             0x00010000      // Indicates that the number of words in an enabled transmit channel FIFO is less than or equal to the transmit FIFO watermark.
#define Word Start Interrupt Enable   0x00001000      // Enables/disables word start interrupts.
#define Sync Error Interrupt Enable   0x00000800      // Enables/disables sync error interrupts.
#define FIFO Error Interrupt Enable   0x00000400      // Enables/disables FIFO error interrupts.
#define FIFO Warning Interrupt Enable 0x00000200      // Enables/disables FIFO warning interrupts.
#define FIFO Request Interrupt Enable 0x00000100      // Enables/disables FIFO request interrupts.
#define FIFO Warning DMA Enable       0x00000002      // Enables/disables DMA requests.
#define FIFO Request DMA Enable       0x00000001      // Enables/disables DMA requests.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR1 register.
//
//*****************************************************************************

#define Transmit FIFO Watermark       0x00000006      // Configures the watermark level for all enabled transmit channels.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR2 register.
//
//*****************************************************************************

#define Synchronous Mode              0x180000000      // Configures between asynchronous and synchronous modes of operation. When configured for a synchronous mode of operation, the receiver must be configured for asynchronous operation.
#define Bit Clock Swap                0x20000000      // When the SAI is in asynchronous mode and this field is set to 1, the transmitter is clocked by the receiver bit clock. When the SAI is in synchronous mode and this field is set to 1, the transmitter is clocked by the transmitter bit clock, but it uses the receiver frame sync.
#define Bit Clock Input               0x10000000      // When set in either asynchronous or synchronous mode and using an internally generated bit clock, configures the internal logic to be clocked as if the bit clock was externally generated. This has the effect of decreasing data input setup time, but increasing data output valid time. This bit has no effect when configured for an externally generated bit clock.
#define MCLK Select                   0x18000000      // Selects the Audio Master Clock used to generate an internally generated bit clock. This field has no effect when configured for an externally generated bit clock.
#define Bit Clock Polarity            0x02000000      // Configures the polarity of the bit clock.
#define Bit Clock Direction           0x01000000      // Configures the direction of the bit clock.
#define Bit Clock Divide              0x00007F80      // Divides down the audio master clock to generate the bit clock when configured for an internal bit clock. The division value is (DIV + 1) * 2.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR3 register.
//
//*****************************************************************************

